orgmode_isw_template.org
* Document Setup :ignore:
# This section contains all the setup necessary to export this org document
# directly into an ISW style PDF The ~ignore~ tags on the headlines are
# necessary
** Setupfile :ignore:
#+SETUPFILE: settings.org
** Docment Type :ignore:
# % This class does the ISW styling for you (together with scrbook).
# %
# % It handles the following:
# % - Proper input and font encoding (Just type, don't care about the LaTeX compiler you use or how to type # German umlauts)
# % - Fonts with ligatures and kerning (Tex Gyre fonts are used, part of every LaTeX installation, text is # nice to read)
# % - Bibliography styling for biblatex (declare your bibliography file and you are ready to go)
# % - Provide command for title page (\makeISWtitle) and declaration of originality ( \declarationOfOriginality)
# % - Loads packages "biblatex" and "graphics"
#+LATEX_HEADER: \usepackage[
#+LATEX_HEADER:     type=MA
# #+LATEX_HEADER:     type=BA
# #+LATEX_HEADER:     type=FA
# #+LATEX_HEADER:     type=SA
# #+LATEX_HEADER:     type=bachelorproject
#+LATEX_HEADER: ]{iswthesis}
** Language :ignore:
# #+LATEX_HEADER: \usepackage[english, ngerman]{babel}
#+LATEX_HEADER: \usepackage[ngerman, english]{babel}
** Latex: Bibliography :ignore:
#+LATEX_HEADER: \addbibresource{bibliography.bib}
** TODO Document Settings: Author, Title, Date :ignore:
# you need to set both titles, latex and orgmode
#+TITLE: Emacs Orgmode ISW Template
#+LATEX_HEADER:\title{Emacs Orgmode ISW Template}
#+LATEX_HEADER:\titleTranslated{Emacs Orgmode ISW Template}
#+AUTHOR: 
#+LATEX_HEADER:\author{Max Mustermann}
#+LATEX_HEADER:\placeOfBirth{Stuttgart}
#+LATEX_HEADER:\address{Seidenstraße 36, 70174 Stuttgart}
#+LATEX_HEADER:\major{Mechatronik}
#+LATEX_HEADER:\matrnr{1234567}
#+LATEX_HEADER:\date{\today}
#+LATEX_HEADER:\supervisor{My supervisor, M.Sc.}
#+LATEX_HEADER:\professor{Prof. Dr.-Ing. Oliver Riedel}
** Begin Document Section :ignore:

\frontmatter
\makeISWtitle
\cleardoublepage
# % start at page (i) after title page:
\setcounter{page}{1} 
\declarationOfOriginality
# % Kurzfassung/Abstract
\cleardoublepage
\tableofcontents
\mainmatter

* Orgmode Template
In order to get started with the template you can use the following empty
document and work from there. This is quite a bit redundant, but as a lot of
things are set up with comments and orgmode specific options they won't be
rendered in a Github / Gitlab preview):

#+begin_src org
,* Document Setup :ignore:
# This section contains all the setup necessary to export this org document
# directly into an ISW style PDF The ~ignore~ tags on the headlines are
# necessary
,** Setupfile :ignore:
,#+SETUPFILE: settings.org
,** Docment Type :ignore:
# % This class does the ISW styling for you (together with scrbook).
# %
# % It handles the following:
# % - Proper input and font encoding (Just type, don't care about the LaTeX
# %   compiler you use or how to type # German umlauts)
# % - Fonts with ligatures and kerning (Tex Gyre fonts are used, part of every
# %   LaTeX installation, text is # nice to read
# % - Bibliography styling for biblatex (declare your bibliography file and you
# %   are ready to go)
# % - Provide command for title page (\makeISWtitle) and declaration of
# %   originality ( \declarationOfOriginality)
# % - Loads packages "biblatex" and "graphics"
,#+LATEX_HEADER: \usepackage[
,#+LATEX_HEADER:     type=MA
# #+LATEX_HEADER:     type=BA
# #+LATEX_HEADER:     type=FA
# #+LATEX_HEADER:     type=SA
# #+LATEX_HEADER:     type=bachelorproject
,#+LATEX_HEADER: ]{iswthesis}
,** Language :ignore:
# #+LATEX_HEADER: \usepackage[english, ngerman]{babel}
,#+LATEX_HEADER: \usepackage[ngerman, english]{babel}
,** Latex: Bibliography :ignore:
,#+LATEX_HEADER: \addbibresource{bibliography.bib}
,** TODO Document Settings: Author, Title, Date :ignore:
# you need to set both titles, latex and orgmode
,#+TITLE: Emacs Orgmode ISW Template
,#+LATEX_HEADER:\title{Emacs Orgmode ISW Template}
,#+LATEX_HEADER:\titleTranslated{Emacs Orgmode ISW Template}
,#+AUTHOR: 
,#+LATEX_HEADER:\author{Max Mustermann}
,#+LATEX_HEADER:\placeOfBirth{Stuttgart}
,#+LATEX_HEADER:\address{Seidenstraße 36, 70174 Stuttgart}
,#+LATEX_HEADER:\major{Mechatronik}
,#+LATEX_HEADER:\matrnr{1234567}
,#+LATEX_HEADER:\date{\today}
,#+LATEX_HEADER:\supervisor{My supervisor, M.Sc.}
,#+LATEX_HEADER:\professor{Prof. Dr.-Ing. Oliver Riedel}
,** Begin Document Section :ignore:

\frontmatter
\makeISWtitle
\cleardoublepage
# % start at page (i) after title page:
\setcounter{page}{1} 
\declarationOfOriginality
# % Kurzfassung/Abstract
\cleardoublepage
\tableofcontents
\mainmatter

,* Your Content
,* Document Ending: Bibliography, Lists, Appendixes :ignore:
\backmatter
\cleardoublepage
\printbibliography
\cleardoublepage
\listoffigures
\cleardoublepage
\listoftables
\cleardoublepage
#+end_src

* (Doom) Emacs specific Configuration
In order to get this file working here are the minimally relevant sections from the doom emacs configuration:
