orgmode_isw_template.tex
% Created 2024-10-24 Thu 13:09
% Intended LaTeX compiler: xelatex
\documentclass[a4paper,oneside,toc=bibliography,toc=listof]{scrbook}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[T1]{fontenc}
\usepackage[utf8]{inputenc}
\usepackage{amsmath, amssymb}
\usepackage{bm}
\usepackage{booktabs}
\usepackage{longtable}
\usepackage[printonlyused, smaller]{acronym}
\usepackage{subcaption}
\usepackage{placeins}
\usepackage{tikz}
\usepackage{pgfplots}
\pgfplotsset{ compat = newest, grid=major, every axis plot/.append style={very thick}, }
\usetikzlibrary{calc,fit, positioning,arrows.meta}
\tikzset{>={Latex[width=2mm,length=2mm]}} % more visible default arrow heads
\tikzstyle{block} = [draw=black, fill=white, rectangle, align=center, minimum height=2em, minimum width=3em]
\tikzstyle{sum} = [draw, circle, node distance=1cm]
\newlength\figureheight
\newlength\figurewidth
\setlength\figureheight{3cm}
\setlength\figurewidth{0.7\textwidth}
\RequirePackage{xcolor}
\definecolor{UStuttDarkBlue}{RGB}{0,81,158}
\definecolor{UStuttLightBlue}{RGB}{0,190,255}
\definecolor{UStuttDarkGreen}{RGB}{59,140,122}
\definecolor{UStuttLightGreen}{RGB}{125,155,101}
\definecolor{UStuttDarkOrange}{RGB}{228,175,52}
\definecolor{UStuttLightOrange}{RGB}{236,218,145}
\usepackage{listings}
\usepackage{scrhack} % if you load listings together with scrbook etc., then load this fixing package as well
\lstset{
basicstyle=\ttfamily\small,  % Set smaller font size
captionpos=b,
commentstyle=\color{UStuttDarkGreen},
frame=single,                    % adds a frame around the code
keepspaces=true,
%keywordstyle=\color{UStuttDarkBlue},
showspaces=false,
showstringspaces=false,          % underline spaces within strings only
showtabs=false,
stringstyle=\color{UStuttDarkBlue},
tabsize=2
}
\PassOptionsToPackage{pdfpagelabels}{hyperref}
\usepackage{hyperref}  % backref linktocpage pagebackref
\ifpdf
\pdfcompresslevel=9
\pdfadjustspacing=1
\fi
\hypersetup{%
%draft, % = no hyperlinking at all
%colorlinks=true,
colorlinks=false,
linktocpage=false, pdfborder={0 0 0},%
breaklinks=true, pdfpagemode=UseNone, pageanchor=true, pdfpagemode=UseOutlines,%
plainpages=false, bookmarksnumbered, bookmarksopen=true, bookmarksopenlevel=1,%
hypertexnames=true, pdfhighlight=/O,%nesting=true,%frenchlinks,%
%urlcolor=Black, linkcolor=Black, citecolor=Black, %pagecolor=Black,%
}
\newcommand{\R}{\mathbb{R}}
\newcommand{\T}{\mathrm{T}}
\newcommand{\mustbe}{\ensuremath{\stackrel{!}{=}}}
\newcommand{\bmat}[1]{ \ensuremath{\begin{bmatrix} #1 \end{bmatrix}} }
\newcommand{\partfrac}[2]{ \ensuremath{\frac{\partial #1}{\partial #2}} }
\newcommand{\ddiff}{\ensuremath{\mathrm{d}}}
\newcommand{\ddt}{\ensuremath{\frac{\ddiff}{\ddiff t}}}
\usepackage{lipsum}
\usepackage{fontspec}
\lstdefinelanguage{org}{keywords={BEGIN,END,CAPTION,NAME,src,results},morecomment=[l]{\#},morestring=[b]"}
\providecommand{\lstlistoflistings}{}
\usepackage{changepage}  % To adjust width
\newenvironment{narrowmargin}{
\begin{center}
\begin{adjustwidth}{-0.5cm}{-0.5cm}
}{
\end{adjustwidth}
\end{center}
}
\newenvironment{mediummargin}{
\begin{center}
\begin{adjustwidth}{-1cm}{-1cm}
}{
\end{adjustwidth}
\end{center}
}
\newenvironment{widemargin}{
\begin{center}
\begin{adjustwidth}{-1.5cm}{-1.5cm}
}{
\end{adjustwidth}
\end{center}
}
\newenvironment{verywidemargin}{
\begin{center}
\begin{adjustwidth}{-2cm}{-2cm}
}{
\end{adjustwidth}
\end{center}
}
\newenvironment{extrawidemargin}{
\begin{center}
\begin{adjustwidth}{-2.5cm}{-2.5cm}
}{
\end{adjustwidth}
\end{center}
}
\usepackage[
type=MA
]{iswthesis}
\usepackage[ngerman, english]{babel}
\addbibresource{bibliography.bib}
\title{Emacs Orgmode ISW Template}
\titleTranslated{Emacs Orgmode ISW Template}
\author{Max Mustermann}
\placeOfBirth{Stuttgart}
\address{Seidenstraße 36, 70174 Stuttgart}
\major{Mechatronik}
\matrnr{1234567}
\date{\today}
\supervisor{My supervisor, M.Sc.}
\professor{Prof. Dr.-Ing. Oliver Riedel}
\date{\today}
\title{Emacs Orgmode ISW Template}
\hypersetup{
 pdfauthor={},
 pdftitle={Emacs Orgmode ISW Template},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\frontmatter
\makeISWtitle
\cleardoublepage

\setcounter{page}{1} 
\declarationOfOriginality

\cleardoublepage
\tableofcontents
\mainmatter
\chapter{Orgmode Template}
\label{sec:org99c1bb0}
In order to get started with the template you can use the following empty
document and work from there. This is quite a bit redundant, but as a lot of
things are set up with comments and orgmode specific options they won't be
rendered in a Github / Gitlab preview):

\begin{lstlisting}[language=org,numbers=none]
* Document Setup :ignore:
# This section contains all the setup necessary to export this org document
# directly into an ISW style PDF The ~ignore~ tags on the headlines are
# necessary
** Setupfile :ignore:
#+SETUPFILE: settings.org
** Docment Type :ignore:
# % This class does the ISW styling for you (together with scrbook).
# %
# % It handles the following:
# % - Proper input and font encoding (Just type, don't care about the LaTeX
# %   compiler you use or how to type # German umlauts)
# % - Fonts with ligatures and kerning (Tex Gyre fonts are used, part of every
# %   LaTeX installation, text is # nice to read
# % - Bibliography styling for biblatex (declare your bibliography file and you
# %   are ready to go)
# % - Provide command for title page (\makeISWtitle) and declaration of
# %   originality ( \declarationOfOriginality)
# % - Loads packages "biblatex" and "graphics"
#+LATEX_HEADER: \usepackage[
#+LATEX_HEADER:     type=MA
# #+LATEX_HEADER:     type=BA
# #+LATEX_HEADER:     type=FA
# #+LATEX_HEADER:     type=SA
# #+LATEX_HEADER:     type=bachelorproject
#+LATEX_HEADER: ]{iswthesis}
** Language :ignore:
# #+LATEX_HEADER: \usepackage[english, ngerman]{babel}
#+LATEX_HEADER: \usepackage[ngerman, english]{babel}
** Latex: Bibliography :ignore:
#+LATEX_HEADER: \addbibresource{bibliography.bib}
** TODO Document Settings: Author, Title, Date :ignore:
# you need to set both titles, latex and orgmode
#+TITLE: Emacs Orgmode ISW Template
#+LATEX_HEADER:\title{Emacs Orgmode ISW Template}
#+LATEX_HEADER:\titleTranslated{Emacs Orgmode ISW Template}
#+AUTHOR: 
#+LATEX_HEADER:\author{Max Mustermann}
#+LATEX_HEADER:\placeOfBirth{Stuttgart}
#+LATEX_HEADER:\address{Seidenstraße 36, 70174 Stuttgart}
#+LATEX_HEADER:\major{Mechatronik}
#+LATEX_HEADER:\matrnr{1234567}
#+LATEX_HEADER:\date{\today}
#+LATEX_HEADER:\supervisor{My supervisor, M.Sc.}
#+LATEX_HEADER:\professor{Prof. Dr.-Ing. Oliver Riedel}
** Begin Document Section :ignore:

\frontmatter
\makeISWtitle
\cleardoublepage
# % start at page (i) after title page:
\setcounter{page}{1} 
\declarationOfOriginality
# % Kurzfassung/Abstract
\cleardoublepage
\tableofcontents
\mainmatter

* Your Content
* Document Ending: Bibliography, Lists, Appendixes :ignore:
\backmatter
\cleardoublepage
\printbibliography
\cleardoublepage
\listoffigures
\cleardoublepage
\listoftables
\cleardoublepage
\end{lstlisting}
\chapter{(Doom) Emacs specific Configuration}
\label{sec:orgd0a10ad}
In order to get this file working here are the minimally relevant sections from the doom emacs configuration:
