orgmode_isw_template.org
** init.el

{{{begin-widemargin}}}
#+begin_src emacs-lisp
(doom! :input

       :completion
       (corfu +orderless)  ; complete with cap(f), cape and a flying feather!
       (helm +childframe +fuzzy +icons)              ; the *other* search engine for love and life

       :ui
       doom              ; what makes DOOM look the way it does
       doom-dashboard    ; a nifty splash screen for Emacs
       (emoji +unicode)  ; 
       hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
       modeline          ; snazzy, Atom-inspired modeline, plus API
       ophints           ; highlight the region an operation acts on
       (popup +defaults)   ; tame sudden yet inevitable temporary windows
       (vc-gutter +pretty) ; vcs diff in the fringe
       vi-tilde-fringe   ; fringe tildes to mark beyond EOB
       workspaces        ; tab emulation, persistence & separate workspaces

       :editor
       file-templates    ; auto-snippets for empty files
       fold              ; (nigh) universal code folding
       snippets          ; my elves. They type so I don't have to

       :emacs
       dired             ; making dired pretty [functional]
       electric          ; smarter, keyword-based electric-indent
       undo              ; persistent, smarter undo for your inevitable mistakes
       vc                ; version-control and Emacs, sitting in a tree

       :term

       :checkers
       syntax              ; tasing you for every semicolon you forget

       :tools
       (eval +overlay)     ; run code, run (also, repls)
       lookup              ; navigate your code and its documentation
       magit             ; a git porcelain for Emacs
       pdf               ; pdf enhancements

       :os
       (:if (featurep :system 'macos) macos)  ; improve compatibility with macOS

       :lang
       emacs-lisp        ; drown in parentheses
       (latex             ; writing papers in Emacs has never been so fun
        +latexmk
        )
       markdown          ; writing docs for people to ignore
       (org               ; organize your plain life in plain text
        +pretty
        +hugo
        +babel
        +latex
       )
       sh                ; she sells {ba,z,fi}sh shells on the C xor

       :email

       :app

       :config
       (default +bindings +smartparens))
#+end_src
{{{end-widemargin}}}

** Defining the scrbook Latex Class
In config.el:

#+begin_src emacs-lisp
(add-to-list 'org-latex-classes
          '("scrbook"
             "\\documentclass{scrbook}"
             ("\\chapter{%s}" . "\\chapter{%s}")
             ("\\section{%s}" . "\\section*{%s}")
             ("\\subsection{%s}" . "\\subsection*{%s}")
             ("\\paragraph{%s}" . "\\paragraph*{%s}")
             )
     )
#+end_src

** org-special-block-extras
Enables interesting stuff such as the ~ignore~ tag, which we use extensively in the Document setup section and the =settings.org= file.

packages.el:
#+begin_src emacs-lisp
(package! org-special-block-extras)
#+end_src

config.el:
{{{begin-widemargin}}}
#+begin_src emacs-lisp
;; enable ox-extra in order to be able to use the :ignore: tag to ignore the export of headlines
(require 'ox-extra)
(ox-extras-activate '(ignore-headlines))
#+end_src
{{{end-widemargin}}}
** Latex Export :: Xelatex

config.el:
#+begin_src emacs-lisp :tangle ./config.el
(after! org
  (setq org-latex-compiler "xelatex")
  (setq org-latex-pdf-process
        '("xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "biber %b"  ;; Run biber to process citations
          "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "rm -f %o/*.log %o/*.out %o/*.toc %o/*.lof %o/*.lot %o/*.synctex.gz"
          )))
#+end_src
** ox-bibtex
config.el:
#+begin_src emacs-lisp :tangle ./config.el
(after! org
  (require 'ox-bibtex))
#+end_src
** bibtex citation format
config.el:
#+begin_src emacs-lisp :tangle ./config.el
(setq bibtex-completion-format-citation-functions
      '((org-mode      . bibtex-completion-format-citation-org-ref)
        (latex-mode    . bibtex-completion-format-citation-cite)
        (markdown-mode . bibtex-completion-format-citation-pandoc-citeproc)))
#+end_src
** helm-bibtex

packages.el:
#+begin_src emacs-lisp :tangle ./packages.el
(package! helm-bibtex)
#+end_src

config.el:  
#+begin_src emacs-lisp :tangle ./config.el
;; helm-bibtex related stuff
(after! helm
  (use-package! helm-bibtex
    :custom
    ;; The line below tells helm-bibtex to find the path to the pdf
    ;; in the "file" field in the .bib file.
    (bibtex-completion-pdf-field "file"))
  ;; I also like to be able to view my library from anywhere in emacs, for
  ;; example if I want to read a paper. I added the keybind below for that.
  (map! :leader
        :desc "Open literature database"
        "o l" #'helm-bibtex))
#+end_src

** TODO bibliography paths
You probably want to change this part when starting to use this:

#+begin_src emacs-lisp :tangle ./config.el
(setq bibtex-completion-bibliography '("~/uni/thesis/bibliography.bib"))
(setq bibtex-completion-library-path '("~/uni/thesis/literature/"))
;; (setq bibtex-completion-notes-path "~/uni/thesis/literature/")
(setq org-ref-default-bibliography '("~/uni/thesis/bibliography.bib"))
(setq org-ref-pdf-directory "~/uni/thesis/literature/")
(setq org-ref-bibliography-notes "~/uni/thesis/literature.org")
#+end_src

** org-ref

#+begin_src emacs-lisp :tangle ./packages.el
(package! org-ref)
#+end_src
{{{begin-widemargin}}}
#+begin_src emacs-lisp :tangle ./config.el
(defun bibtex-completion-format-citation-org-ref (keys)
  "Format the citation for `org-ref'."
  (mapconcat (lambda (key) (format "[[cite:%s]]" key)) keys ", "))

(use-package! org-ref
    :after org
    :init
    ; code to run before loading org-ref
    :config
    ; code to run after loading org-ref
    (after! org
      (use-package! org-ref
        :config
        ;; Set up citation format for org-mode using org-ref
        (setq bibtex-completion-format-citation-functions
              '((org-mode . bibtex-completion-format-citation-org-ref)
                (latex-mode . bibtex-completion-format-citation-cite)
                (markdown-mode . bibtex-completion-format-citation-pandoc-citeproc))))
      ))
#+end_src
{{{end-widemargin}}}
** Code Export
In order to export to ~listings~ blocks instead of the default ~verbatim~ blocks, we need to set this somewhere in config.el:
#+begin_src emacs-lisp
(after! org
  (setq org-latex-listings t)
  (setq org-latex-src-block-backend 'listings))
#+end_src

This way we can then export code blocks such as this:
#+begin_src org
,#+NAME: lst:bad_code_example
,#+CAPTION: "This code does not provide any insights and should not be included."
,#+BEGIN_SRC c++ :exports code
#include <iostream>

using namespace std;

int main(void){
    cout << "Hello world." << endl;
    return 0;
}
,#+END_SRC
#+end_src

Into something like this

#+NAME: lst:bad_code_example
#+CAPTION: "This code does not provide any insights and should not be included."
#+BEGIN_SRC c++ :exports code
#include <iostream>

using namespace std;

int main(void){
    cout << "Hello world." << endl;
    return 0;
}
#+END_SRC

