orgmode_isw_template.tex
\section{init.el}
\label{sec:org2d8626b}

\begin{widemargin}
\begin{lstlisting}[language=Lisp,numbers=none]
(doom! :input

       :completion
       (corfu +orderless)  ; complete with cap(f), cape and a flying feather!
       (helm +childframe +fuzzy +icons)              ; the *other* search engine for love and life

       :ui
       doom              ; what makes DOOM look the way it does
       doom-dashboard    ; a nifty splash screen for Emacs
       (emoji +unicode)  ; 
       hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
       modeline          ; snazzy, Atom-inspired modeline, plus API
       ophints           ; highlight the region an operation acts on
       (popup +defaults)   ; tame sudden yet inevitable temporary windows
       (vc-gutter +pretty) ; vcs diff in the fringe
       vi-tilde-fringe   ; fringe tildes to mark beyond EOB
       workspaces        ; tab emulation, persistence & separate workspaces

       :editor
       file-templates    ; auto-snippets for empty files
       fold              ; (nigh) universal code folding
       snippets          ; my elves. They type so I don't have to

       :emacs
       dired             ; making dired pretty [functional]
       electric          ; smarter, keyword-based electric-indent
       undo              ; persistent, smarter undo for your inevitable mistakes
       vc                ; version-control and Emacs, sitting in a tree

       :term

       :checkers
       syntax              ; tasing you for every semicolon you forget

       :tools
       (eval +overlay)     ; run code, run (also, repls)
       lookup              ; navigate your code and its documentation
       magit             ; a git porcelain for Emacs
       pdf               ; pdf enhancements

       :os
       (:if (featurep :system 'macos) macos)  ; improve compatibility with macOS

       :lang
       emacs-lisp        ; drown in parentheses
       (latex             ; writing papers in Emacs has never been so fun
        +latexmk
        )
       markdown          ; writing docs for people to ignore
       (org               ; organize your plain life in plain text
        +pretty
        +hugo
        +babel
        +latex
       )
       sh                ; she sells {ba,z,fi}sh shells on the C xor

       :email

       :app

       :config
       (default +bindings +smartparens))
\end{lstlisting}
\end{widemargin}
\section{Defining the scrbook Latex Class}
\label{sec:org3501a55}
In config.el:

\begin{lstlisting}[language=Lisp,numbers=none]
(add-to-list 'org-latex-classes
          '("scrbook"
             "\\documentclass{scrbook}"
             ("\\chapter{%s}" . "\\chapter{%s}")
             ("\\section{%s}" . "\\section*{%s}")
             ("\\subsection{%s}" . "\\subsection*{%s}")
             ("\\paragraph{%s}" . "\\paragraph*{%s}")
             )
     )
\end{lstlisting}
\section{org-special-block-extras}
\label{sec:org8a71643}
Enables interesting stuff such as the \texttt{ignore} tag, which we use extensively in the Document setup section and the \texttt{settings.org} file.

packages.el:
\begin{lstlisting}[language=Lisp,numbers=none]
(package! org-special-block-extras)
\end{lstlisting}

config.el:
\begin{widemargin}
\begin{lstlisting}[language=Lisp,numbers=none]
;; enable ox-extra in order to be able to use the :ignore: tag to ignore the export of headlines
(require 'ox-extra)
(ox-extras-activate '(ignore-headlines))
\end{lstlisting}
\end{widemargin}
\section{Latex Export :: Xelatex}
\label{sec:orga145337}

config.el:
\begin{lstlisting}[language=Lisp,numbers=none]
(after! org
  (setq org-latex-compiler "xelatex")
  (setq org-latex-pdf-process
        '("xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "biber %b"  ;; Run biber to process citations
          "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "rm -f %o/*.log %o/*.out %o/*.toc %o/*.lof %o/*.lot %o/*.synctex.gz"
          )))
\end{lstlisting}
\section{ox-bibtex}
\label{sec:orgf666890}
config.el:
\begin{lstlisting}[language=Lisp,numbers=none]
(after! org
  (require 'ox-bibtex))
\end{lstlisting}
\section{bibtex citation format}
\label{sec:org8354eb2}
config.el:
\begin{lstlisting}[language=Lisp,numbers=none]
(setq bibtex-completion-format-citation-functions
      '((org-mode      . bibtex-completion-format-citation-org-ref)
        (latex-mode    . bibtex-completion-format-citation-cite)
        (markdown-mode . bibtex-completion-format-citation-pandoc-citeproc)))
\end{lstlisting}
\section{helm-bibtex}
\label{sec:orgfafd4eb}

packages.el:
\begin{lstlisting}[language=Lisp,numbers=none]
(package! helm-bibtex)
\end{lstlisting}

config.el:  
\begin{lstlisting}[language=Lisp,numbers=none]
;; helm-bibtex related stuff
(after! helm
  (use-package! helm-bibtex
    :custom
    ;; The line below tells helm-bibtex to find the path to the pdf
    ;; in the "file" field in the .bib file.
    (bibtex-completion-pdf-field "file"))
  ;; I also like to be able to view my library from anywhere in emacs, for
  ;; example if I want to read a paper. I added the keybind below for that.
  (map! :leader
        :desc "Open literature database"
        "o l" #'helm-bibtex))
\end{lstlisting}
\section{{\bfseries\sffamily TODO} bibliography paths}
\label{sec:org4410698}
You probably want to change this part when starting to use this:

\begin{lstlisting}[language=Lisp,numbers=none]
(setq bibtex-completion-bibliography '("~/uni/thesis/bibliography.bib"))
(setq bibtex-completion-library-path '("~/uni/thesis/literature/"))
;; (setq bibtex-completion-notes-path "~/uni/thesis/literature/")
(setq org-ref-default-bibliography '("~/uni/thesis/bibliography.bib"))
(setq org-ref-pdf-directory "~/uni/thesis/literature/")
(setq org-ref-bibliography-notes "~/uni/thesis/literature.org")
\end{lstlisting}
\section{org-ref}
\label{sec:orgac0e126}

\begin{lstlisting}[language=Lisp,numbers=none]
(package! org-ref)
\end{lstlisting}
\begin{widemargin}
\begin{lstlisting}[language=Lisp,numbers=none]
(defun bibtex-completion-format-citation-org-ref (keys)
  "Format the citation for `org-ref'."
  (mapconcat (lambda (key) (format "[[cite:%s]]" key)) keys ", "))

(use-package! org-ref
    :after org
    :init
    ; code to run before loading org-ref
    :config
    ; code to run after loading org-ref
    (after! org
      (use-package! org-ref
        :config
        ;; Set up citation format for org-mode using org-ref
        (setq bibtex-completion-format-citation-functions
              '((org-mode . bibtex-completion-format-citation-org-ref)
                (latex-mode . bibtex-completion-format-citation-cite)
                (markdown-mode . bibtex-completion-format-citation-pandoc-citeproc))))
      ))
\end{lstlisting}
\end{widemargin}
\section{Code Export}
\label{sec:orgecc9ca5}
In order to export to \texttt{listings} blocks instead of the default \texttt{verbatim} blocks, we need to set this somewhere in config.el:
\begin{lstlisting}[language=Lisp,numbers=none]
(after! org
  (setq org-latex-listings t)
  (setq org-latex-src-block-backend 'listings))
\end{lstlisting}

This way we can then export code blocks such as this:
\begin{lstlisting}[language=org,numbers=none]
#+NAME: lst:bad_code_example
#+CAPTION: "This code does not provide any insights and should not be included."
#+BEGIN_SRC c++ :exports code
#include <iostream>

using namespace std;

int main(void){
    cout << "Hello world." << endl;
    return 0;
}
#+END_SRC
\end{lstlisting}

Into something like this

\begin{lstlisting}[language=c++,label=lst:bad_code_example,caption={``This code does not provide any insights and should not be included.''},captionpos=b,numbers=none]
#include <iostream>

using namespace std;

int main(void){
    cout << "Hello world." << endl;
    return 0;
}
\end{lstlisting}
