orgmode_isw_template.org
* Example Section: Better Margin Control
Here are a bunch of examples for the newly added margins. Code blocks show them best, as there is a visible border but they are generic so I've also added a table as well.

In org-mode all of them look more or less like this (*to prevent the Macro being executed I have added Zero Width Space characters here so copy/pasting this won't work*):
#+begin_src org
...
{{{ begin-narrowmargin}}} <- Zero Width Space characters in here

{\{{begin-narrowmargin}}}
,#+begin_src emacs-lisp
  (message "Narrow margin example")
,#+end_src

| A | B | C | D | E | F | A | B | C | D | E | F | A | B |
|---+---+---+---+---+---+---+---+---+---+---+---+---+---+
| 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 |
| 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 |...
{{{ end-narrowmargin}}} <- Zero Width Space characters in here
...
#+end_src

** Narrow Margin (0.5cm)

{{{begin-narrowmargin}}}
#+begin_src emacs-lisp
  (message "Narrow margin example")
#+end_src

| A | B | C | D | E | F | A | B | C | D | E | F | A | B | C | D | E | F | A | B | C | D | E |
|---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---|
| 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 |
| 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 |
{{{end-narrowmargin}}}

** Medium Margin (1cm)

{{{begin-mediummargin}}}
#+begin_src emacs-lisp
  (message "Medium margin example")
#+end_src

| A | B | C | D | E | F | A | B | C | D | E | F | A | B | C | D | E | F | A | B | C | D | E | F |
|---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---|
| 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 |
| 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 |
{{{end-mediummargin}}}

** Wide Margin (1.5cm)

{{{begin-widemargin}}}
#+begin_src emacs-lisp
  (message "Wide margin example")
#+end_src

| A | B | C | D | E | F | A | B | C | D | E | F | A | B | C | D | E | F | A | B | C | D | E | F | A | B |
|---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---|
| 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 |
| 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 |

{{{end-widemargin}}}

** Very Wide Margin (2cm)

{{{begin-verywidemargin}}}
#+begin_src emacs-lisp
  (message "Very wide margin example")
#+end_src

| A | B | C | D | E | F | A | B | C | D | E | F | A | B | C | D | E | F | A | B | C | D | E | F | A | B | C |
|---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---|
| 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 |
| 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 |
{{{end-verywidemargin}}}

** Extra Wide Margin (2.5cm)

{{{begin-extrawidemargin}}}
#+begin_src emacs-lisp
  (message "Extra wide margin example")
#+end_src

| Gadget | A | B | C | D | E | F | A | B | C | D | E | F | A | B | C | D | E | F | A | B | C | D | E | F | Units |
|--------+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+-------|
| Phone  | 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 |     1 |
| Laptop | 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 |     2 |
{{{end-extrawidemargin}}}

* Quotes

Here are some random quotes from the ISW bibliography.

So let's just quote cite:Kohm2013

- cite:talbot2014

- Talbot, N. (2014). User manual for glossaries.sty v4.09.

- A quote with page number: [[cite:talbot2014]][p.10] (not sure if this one works as in intended)

  - [[cite:Hoffmann2014]]

* Import of the rest of the chapters
Lets add in the other chapters here:

#+begin_src org
#+LATEX: \input{chapters/Introduction}
#+LATEX: \input{chapters/Examples}
#+LATEX: \input{chapters/Tooling}

#+LATEX: \input{chapters/Acronyms}
#+LATEX: \input{chapters/Symbols}
#+end_src

When Importing everything this way, we get a bunch of errors / warnings. As they
are caused by the template itself I won't bother to fix them here. Commenting
the ~#+LATEX~ lines out will compile a working document.

#+LATEX: \input{chapters/Introduction}
#+LATEX: \input{chapters/Examples}
#+LATEX: \input{chapters/Tooling}

#+LATEX: \input{chapters/Acronyms}
#+LATEX: \input{chapters/Symbols}
* Document Ending: Bibliography, Lists, Appendixes :ignore:
\backmatter
\cleardoublepage
\printbibliography
\cleardoublepage
\listoffigures
\cleardoublepage
\listoftables
\cleardoublepage

