orgmode_isw_template.tex
\chapter{Example Section: Better Margin Control}
\label{sec:orgffd2a0c}
Here are a bunch of examples for the newly added margins. Code blocks show them best, as there is a visible border but they are generic so I've also added a table as well.

In org-mode all of them look more or less like this (\textbf{to prevent the Macro being executed I have added Zero Width Space characters here so copy/pasting this won't work}):
\begin{lstlisting}[language=org,numbers=none]
...
{{{ begin-narrowmargin}}} <- Zero Width Space characters in here

{\{{begin-narrowmargin}}}
#+begin_src emacs-lisp
  (message "Narrow margin example")
#+end_src

| A | B | C | D | E | F | A | B | C | D | E | F | A | B |
|---+---+---+---+---+---+---+---+---+---+---+---+---+---+
| 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 | 3 | 1 | 3 | 6 | 2 | 8 |
| 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 | 9 | 2 | 2 | 7 | 5 | 7 |...
{{{ end-narrowmargin}}} <- Zero Width Space characters in here
...
\end{lstlisting}
\section{Narrow Margin (0.5cm)}
\label{sec:org6765ce8}

\begin{narrowmargin}
\begin{lstlisting}[language=Lisp,numbers=none]
  (message "Narrow margin example")
\end{lstlisting}

\begin{center}
\begin{tabular}{rrrrrrrrrrrrrrrrrrrrrrr}
A & B & C & D & E & F & A & B & C & D & E & F & A & B & C & D & E & F & A & B & C & D & E\\
\hline
2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3 & 1 & 3\\
5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9 & 2 & 2\\
\end{tabular}
\end{center}
\end{narrowmargin}
\section{Medium Margin (1cm)}
\label{sec:org5632077}

\begin{mediummargin}
\begin{lstlisting}[language=Lisp,numbers=none]
  (message "Medium margin example")
\end{lstlisting}

\begin{center}
\begin{tabular}{rrrrrrrrrrrrrrrrrrrrrrrr}
A & B & C & D & E & F & A & B & C & D & E & F & A & B & C & D & E & F & A & B & C & D & E & F\\
\hline
2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3 & 1 & 3 & 6\\
5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9 & 2 & 2 & 7\\
\end{tabular}
\end{center}
\end{mediummargin}
\section{Wide Margin (1.5cm)}
\label{sec:orgcc412d2}

\begin{widemargin}
\begin{lstlisting}[language=Lisp,numbers=none]
  (message "Wide margin example")
\end{lstlisting}

\begin{center}
\begin{tabular}{rrrrrrrrrrrrrrrrrrrrrrrrrr}
A & B & C & D & E & F & A & B & C & D & E & F & A & B & C & D & E & F & A & B & C & D & E & F & A & B\\
\hline
2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3 & 1 & 3 & 6 & 2 & 8\\
5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9 & 2 & 2 & 7 & 5 & 7\\
\end{tabular}
\end{center}

\end{widemargin}
\section{Very Wide Margin (2cm)}
\label{sec:orgcb15d45}

\begin{verywidemargin}
\begin{lstlisting}[language=Lisp,numbers=none]
  (message "Very wide margin example")
\end{lstlisting}

\begin{center}
\begin{tabular}{rrrrrrrrrrrrrrrrrrrrrrrrrrr}
A & B & C & D & E & F & A & B & C & D & E & F & A & B & C & D & E & F & A & B & C & D & E & F & A & B & C\\
\hline
2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3\\
5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9\\
\end{tabular}
\end{center}
\end{verywidemargin}
\section{Extra Wide Margin (2.5cm)}
\label{sec:org15d4bdf}

\begin{extrawidemargin}
\begin{lstlisting}[language=Lisp,numbers=none]
  (message "Extra wide margin example")
\end{lstlisting}

\begin{center}
\begin{tabular}{lrrrrrrrrrrrrrrrrrrrrrrrrr}
Gadget & A & B & C & D & E & F & A & B & C & D & E & F & A & B & C & D & E & F & A & B & C & D & E & F & Units\\
\hline
Phone & 2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3 & 1 & 3 & 6 & 2 & 8 & 3 & 1 & 3 & 6 & 1\\
Laptop & 5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9 & 2 & 2 & 7 & 5 & 7 & 9 & 2 & 2 & 7 & 2\\
\end{tabular}
\end{center}
\end{extrawidemargin}
\chapter{Quotes}
\label{sec:org8632686}

Here are some random quotes from the ISW bibliography.

So let's just quote \cite{Kohm2013}

\begin{itemize}
\item \cite{talbot2014}

\item Talbot, N. (2014). User manual for glossaries.sty v4.09.

\item A quote with page number: \cite{talbot2014}{[}p.10] (not sure if this one works as in intended)

\begin{itemize}
\item \cite{Hoffmann2014}
\end{itemize}
\end{itemize}
\chapter{Import of the rest of the chapters}
\label{sec:org33e130c}
Lets add in the other chapters here:

\begin{lstlisting}[language=org,numbers=none]
#+LATEX: \input{chapters/Introduction}
#+LATEX: \input{chapters/Examples}
#+LATEX: \input{chapters/Tooling}

#+LATEX: \input{chapters/Acronyms}
#+LATEX: \input{chapters/Symbols}
\end{lstlisting}

When Importing everything this way, we get a bunch of errors / warnings. As they
are caused by the template itself I won't bother to fix them here. Commenting
the \texttt{\#+LATEX} lines out will compile a working document.

\input{chapters/Introduction}
\input{chapters/Examples}
\input{chapters/Tooling}

\input{chapters/Acronyms}
\input{chapters/Symbols}
\backmatter
\cleardoublepage
\printbibliography
\cleardoublepage
\listoffigures
\cleardoublepage
\listoftables
\cleardoublepage
\end{document}
